cfd/OpenFOAM/compressible/rhoSimpleFoam/04_Vorticity/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}

// ************************************************************************* //

limitT
{
    type       limitTemperature;
    active     yes;
    min        101;
    max        1000;
    selectionMode all;
}

// ************************************************************************* //
