cfd/OpenFOAM/compressible/rhoSimpleFoam/04_Vorticity/system/include/controlVolume
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Control volume dimensions
controlVolOriginX  -30.0;
controlVolLength   120.0;
controlVolWidth     40.0;
controlVolHeight    40.0;

// Main section dimensions
mainSectionOriginX -10.0;
mainSectionLength   30.0;

// Cell size
mainSectionCellSize 1.0;
